Carjes23/STM32CortexM4ElectronicaDigital/ProyectoFinalEntrega/App/Src/main.c
/*
 ******************************************************************************
 * @file           : main.c
 * @author         : dacardenasj
 * @brief          : Main program body
 ******************************************************************************
 * @credits
 *
 * Taller V. Electronica Digital & Microcontroladores
 * Facultad de Ciencias
 * Ing. Física
 *
 * Universidad Nacional de Colombia
 * Sede Medellín
 * 2023-01S
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 * Proyecto final el cual consiste en inegrar una pantalla en fucionamiento
 * la cual recibe instrucciones desde el micro lo que incluye rellenar rectangulos de
 * colores solidos y también rellenar imagenes.
 *
 ******************************************************************************
 */
/* Librerias que se van a utilizar a lo laro del proyecto. */
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>

#include <stm32f4xx.h>

#include "GPIOxDriver.h"
#include "USARTxDriver.h"
#include "BasicTimer.h"
#include "SysTick.h"
#include "SPIxDriver.h"
#include "PLLDriver.h"
#include "PwmDriver.h"
#include "ExtiDriver.h"
#include "ILI9341.h"
#include "images.h"

// Definiciones MACROS para la direccion.
#define RIGHT 	1
#define UP 		2
#define LEFT 	3
#define DOWN 	4
#define PAUSE 	5

//Data de prueba para el USART2
char string[] = "Hola ";

/************************* Configuracion de Perifericos *************************/

PWM_Handler_t pwmadc = { 0 };   // PWM encargado del ADC


BasicTimer_Handler_t handlerTim2 = { 0 }; // Timer para el blinking
BasicTimer_Handler_t handlerTim5 = { 0 }; // Timer encargado del ADC & Movimiento

GPIO_Handler_t tx2pin = { 0 };	//Pin para configurar la trasmision del USART2
GPIO_Handler_t rx2pin = { 0 };	//Pin para configurar la recepcion del USART2
USART_Handler_t HandlerTerminal = { 0 }; 	//Handler para manejar el USART2

uint8_t usart2image = 0; //Dato recibido por el usart 2:; Imagenes

GPIO_Handler_t handlerUserLedPin = { 0 }; //Led de usuario para el blinking

// Ultimos datos de cada ADC y contadores para su correcto funcionamiento
uint16_t adcLastData1 = 0;
uint16_t adcLastData2 = 0;
uint8_t adcIsCompleteCount = 0;

/*
 * Pines y handlers necesarios para manipular la pantalla
 * CS -> Chip Select
 * RST -> Reset
 * DC -> Data / Command (Seleccionamos que estamos mandando si datos o comandos)
 * SIPI -> Que SPI se va a utilizar en este caso el 2
 * MOSI -> Master Output Slave Input -> El micro envia datos que la pantalla recibe
 * SCK -> Clock del SPI.
 * ILI -> Handler de la pantalla
 */

GPIO_Handler_t CSPrueba = { 0 };
GPIO_Handler_t RSTPrueba = { 0 };
GPIO_Handler_t DCPrueba = { 0 };
SPI_Handler_t SPIPrueba = { 0 };
GPIO_Handler_t MOSIPrueba = { 0 };
GPIO_Handler_t SCKPrueba = { 0 };
ILI9341_Handler_t ili = { 0 };

/************************* Configuracion de Variables del programa *************************/

// Variables: Sintonización del MCU
uint8_t trimval = 13;

// Variables: Escenario de Juego
uint16_t backgroundColor = ILI9341_BLACK;
uint16_t snakeColor = ILI9341_DARKGREEN;
uint16_t wallColor = ILI9341_BLUE;
uint8_t  direction = PAUSE;

// Variables: Posiciones de Juego
uint16_t headPositionX = 0;
uint16_t headPositionY = 0;
uint16_t tailPositionX = 0;
uint16_t tailPositionY = 0;

//Score y score temporal para el  aumento de velocidad
uint8_t score = 0;
uint8_t tempScore = 0;

// Variables: Parametros Default de Snake
uint16_t snakeSize = 3;  // tamaño inicial
uint16_t snakePositions[2][300] = { { 16 * 6, 16 * 7, 16 * 8 },
									{ 16 * 7, 16* 7, 16 * 7 } };

// Buffer para envio de datos
char bufferData[128] = { 0 };

// Variables: Parametros Default de Comida
uint16_t foodColor = ILI9341_PINK;

//Tamaño de cada cuadricula en el juego
uint8_t squareSize = 15;


//Iniacialización variables de la comida
uint16_t foodPositionX = 0;
uint16_t foodPositionY = 0;


// Variables: Banderas de Estados
bool banderaComida = false; //Si hay comida en pantalla
bool flagFoodCollision = false; //Si se comio la comida
bool flagDeath = false; //Bandera que se lanza cuando se muere la culebra
bool enableChangeDir = 1; //Bandera para filtar direcciones en el momento cuando nose ha inciado
bool newChangeRecently = 0; //Bandera para filtar direcciones rapidas
bool enableChange = 1; //Bandera para no permitir movimientos mientras carga la pantalla
bool star = 0; //Si ya se inicio el juego o se siguente en men

// Variables: Movimiento & cambio
uint8_t newDirVal = 0; //Nueva variable de movimiento

// Variables: Contadores
uint32_t contadorPan = 0;		//Contador para verificar si la pantalla esta llena
uint8_t contador10Segundos = 0;	//Contador que cuenta 10 segundos
uint8_t contadorMovimiento = 0;	//Contador que ayuda para el movimiento cada ciertas transiciones del ADC
uint8_t contadorNewChange = 0;	//Cotador que cuenta para permitir un nuevo cambio de direccion

// Variables: Configuración ADC
uint32_t periodADC = 25000;		//Periodo "Facil" para el adc el cual afecta directamente la velocidad de la snake
uint16_t duttyValue = 10;		//Duttycycle lo suficientemente bajo para no verse afectado por el ADC

/************************* Configuracion del MenuSnake *************************/

// Seleccion de modo
bool gameMode = 0;	//Si se esta en gameMode o se encuentra en el Menu
uint8_t selected = 1;	//Cual nivel se selecciono

// Parametros de menú
uint16_t menucolor = ILI9341_PURPLE;		//Color de las letras menu
uint16_t menucolorSelect = ILI9341_WHITE; //Color de las letras seleccionadas en el menu

// Opciones de menú textos
char *menu1 = "Easy";
char *menu2 = "Normal";
char *menu3 = "Hard";

// Posiciones de menú posiciones iniciales menu
uint16_t menux = 30;
uint16_t menuy = 30;

// Refresco de menú (Estado de LED)
uint8_t flagRefrescoMenu = 0;

// Inicialización de nivel
uint8_t level = 0;

/************************* Configuracion de Botones *************************/
/*
 * Configuracion de los botones con sus repectivos Exti
 */
GPIO_Handler_t handlerLeft = { 0 };
EXTI_Config_t handlerExtiLeft = { 0 };

GPIO_Handler_t handlerRight = { 0 };
EXTI_Config_t handlerExtiRight = { 0 };

GPIO_Handler_t handlerUp = { 0 };
EXTI_Config_t handlerExtiUp = { 0 };

GPIO_Handler_t handlerDown = { 0 };
EXTI_Config_t handlerExtiDown = { 0 };


GPIO_Handler_t handlerMenu = { 0 };
EXTI_Config_t handlerExtiMenu= { 0 };


// Cabeceras de funciones
bool checkCollisionFood(uint16_t x, uint16_t y); //Funciones que verifica la cualicion
void drawInitialSnake(void);	//Funcion que se encarga de dibujar el estado inicial de la snake
void advanceSnake(void);		//Funcion que se encarga de avanzar la snake
void changeDirection(void);		//Se ambia la direccion del movimiento
void createFood(void);			//Se crea la comida si no esta creada
void randomFood(void);			//Randomiza en valor de la coida
void checkCollision(void);		//Verifica si hay colisiones
void resetEasyMode(void);		//Se inicia el modo facil
void initSystem(void);			//Funcion de inicio
void USART2Rx_Callback(void);	//Funcion que se encarga del manejo del usart2
void increseSpeed(void);		//Se incrementa la velocidad
void updateMenu(void);			//Para cambiar los valores del menu
void resetNormalMode(void);//Se inicia el modo Normal
void resetHardMode(void);//Se inicia el modo Hard

int main(void) {

