Carjes23/STM32CortexM4ElectronicaDigital/ProyectoFinalEntrega/App/Src/main.c
	// Iniciamos el programa
	initSystem();

	// Enviamos test de USART
	writeString(&HandlerTerminal, string);

	// Definimos rotación & Fondo de pantalla
	Ili_setRotation(&ili, 3);
	ILI9341_FillRectangle(&ili, 0, 0, ILI9341_TFTHEIGHT - 1,
						ILI9341_TFTWIDTH - 1, backgroundColor);

	while (1) {
		// Selección de modo de Juego
		if (gameMode) {

			// Incrementos de velocidad por puntaje
			if ((tempScore + 1) % 2 == 0) {
				tempScore = 0;
				increseSpeed();
			}

			// Regeneración de Comida
			if (banderaComida == false && flagDeath == 0) {
				randomFood();
				createFood();
			}

			// Avance de Snake
			if (contadorMovimiento > 9 && flagDeath == 0) {
				contadorMovimiento = 0;
				advanceSnake();
			}

			// Reset de parametros de control de movimiento
			if (contadorNewChange > 9) {
				enableChange = 1;
				contadorNewChange = 0;
				newChangeRecently = 0;

			}

			// Cambio de dirección
			if (newDirVal != 0 && flagDeath == 0) {
				changeDirection();
			}

			if(flagDeath == 1){
				imageSelector(&ili, 2);

				// Reiniciamos variable de muerte
				flagDeath = 0;

				// Escritura de puntaje
				sprintf(bufferData, "Score %d", score);

				// Inicio de posición
				uint16_t x = 100;
				uint16_t y = 170;
				uint16_t color = ILI9341_PURPLE;
				ILI9341_WriteString(&ili, x, y, color, backgroundColor,
						bufferData, 3, 3);
				delay_ms(1000);
				if (level == 1) {
					resetEasyMode();
				} else if (level == 2) {
					resetNormalMode();
				} else if (level == 3) {
					resetHardMode();
				} else {
					resetEasyMode();
				}
			}


		} else {
			//Si estamos en el menu verificamos si es hora de refrescar

			if (flagRefrescoMenu > 1) {
				//Se pregunta por la varibable nueva direccion para ver donde se mueve
				//Se selecciona el juego con la derecha
				if (newDirVal == RIGHT) {
					level = selected;
					newDirVal = 0;
				} else if (newDirVal == DOWN) {
					if (selected < 3) {
						selected++;
					} else {
						selected = 1;
					}
					newDirVal = 0;
				} else if (newDirVal == UP) {
					if (selected > 1) {
						selected--;
					} else {
						selected = 3;
					}
					newDirVal = 0;
				}
				//Se reinicia la variable de conteo de meni
				flagRefrescoMenu = 0;
				//Se actualiza los valores del menu
				updateMenu();
			}
			//Al darle a la derecha el level es diferente de cero se selecciona el nivel y se inicia el juego
			if (level != 0) {
				gameMode = 1;
				if (level == 1) {
					resetEasyMode();
				} else if (level == 2) {
					resetNormalMode();
				} else if (level == 3) {
					resetHardMode();
				} else {
					resetEasyMode();
				}

			}
		}

	}

	return 0;
}

void initSystem(void) {
	//Activacion cooprocesador matematico
	SCB->CPACR |= (0xF << 20);
	//Se conifgura el PLL en 80
	configPLL(80);
	//Se configura el Systick automaticamente
	config_SysTick();

	//Led de usuario usado para el blinking

	handlerUserLedPin.pGPIOx = GPIOA; //Se encuentra en el el GPIOA
	handlerUserLedPin.GPIO_PinConfig_t.GPIO_PinNumber = PIN_5; // Es el pin 5.
	handlerUserLedPin.GPIO_PinConfig_t.GPIO_PinMode = GPIO_MODE_OUT; //Se utiliza como salida
	handlerUserLedPin.GPIO_PinConfig_t.GPIO_PinOPType = GPIO_OTYPE_PUSHPULL; //Salida PushPull
	handlerUserLedPin.GPIO_PinConfig_t.GPIO_PinPuPdControl = GPIO_PUPDR_NOTHING; //No se usa ninguna resistencia
	handlerUserLedPin.GPIO_PinConfig_t.GPIO_PinSpeed = GPIO_OSPEED_FAST; //Se usa en velocidad rapida

	GPIO_Config(&handlerUserLedPin); //Se carga la configuración para el Led.

	//Handeler para manejar el USAR2
	HandlerTerminal.ptrUSARTx = USART2;
	HandlerTerminal.USART_Config.USART_baudrate = 921600;
	HandlerTerminal.USART_Config.USART_datasize = USART_DATASIZE_8BIT;
	HandlerTerminal.USART_Config.USART_mode = USART_MODE_RXTX;
	HandlerTerminal.USART_Config.USART_parity = USART_PARITY_NONE;
	HandlerTerminal.USART_Config.USART_stopbits = USART_STOPBIT_1;
	HandlerTerminal.USART_Config.USART_RX_Int_Ena = ENABLE;

	USART_Config(&HandlerTerminal);
	//Configuración Timer 2 que controlara el blinking

	handlerTim2.ptrTIMx = TIM2; //El timer que se va a usar
	handlerTim2.TIMx_Config.TIMx_interruptEnable = 1; //Se habilitan las interrupciones
	handlerTim2.TIMx_Config.TIMx_mode = BTIMER_MODE_UP; //Se usara en modo ascendente
	handlerTim2.TIMx_Config.TIMx_period = 2500; //Se define el periodo en este caso el led cambiara cada 250ms
	handlerTim2.TIMx_Config.TIMx_speed = BTIMER_SPEED_100us; //Se define la "velocidad" que se usara

	BasicTimer_Config(&handlerTim2); //Se carga la configuración.

	//Pines necesarios para el uso del USART2
	tx2pin.pGPIOx = GPIOA;
	tx2pin.GPIO_PinConfig_t.GPIO_PinNumber = PIN_2;
	tx2pin.GPIO_PinConfig_t.GPIO_PinMode = GPIO_MODE_ALTFN;
	tx2pin.GPIO_PinConfig_t.GPIO_PinPuPdControl = GPIO_PUPDR_PULLUP;
	tx2pin.GPIO_PinConfig_t.GPIO_PinSpeed = GPIO_OSPEED_FAST; //Se usa en velocidad rapida
	tx2pin.GPIO_PinConfig_t.GPIO_PinAltFunMode = 7;

	GPIO_Config(&tx2pin);

	rx2pin.pGPIOx = GPIOA;
	rx2pin.GPIO_PinConfig_t.GPIO_PinNumber = PIN_3;
	rx2pin.GPIO_PinConfig_t.GPIO_PinMode = GPIO_MODE_ALTFN;
	rx2pin.GPIO_PinConfig_t.GPIO_PinPuPdControl = GPIO_PUPDR_PULLUP;
	rx2pin.GPIO_PinConfig_t.GPIO_PinSpeed = GPIO_OSPEED_FAST;
	rx2pin.GPIO_PinConfig_t.GPIO_PinAltFunMode = 7;

	GPIO_Config(&rx2pin);

	//Pines necesarios para el uso de la pantalla

	CSPrueba.pGPIOx = GPIOA;
	CSPrueba.GPIO_PinConfig_t.GPIO_PinNumber = PIN_8;
	CSPrueba.GPIO_PinConfig_t.GPIO_PinMode = GPIO_MODE_OUT;
	CSPrueba.GPIO_PinConfig_t.GPIO_PinOPType = GPIO_OTYPE_PUSHPULL;
	CSPrueba.GPIO_PinConfig_t.GPIO_PinPuPdControl = GPIO_PUPDR_NOTHING;
	CSPrueba.GPIO_PinConfig_t.GPIO_PinSpeed = GPIO_OSPEED_HIGH;

	GPIO_Config(&CSPrueba);
	GPIO_WritePin(&CSPrueba, SET);

	RSTPrueba.pGPIOx = GPIOB;
	RSTPrueba.GPIO_PinConfig_t.GPIO_PinNumber = PIN_10;
	RSTPrueba.GPIO_PinConfig_t.GPIO_PinMode = GPIO_MODE_OUT;
	RSTPrueba.GPIO_PinConfig_t.GPIO_PinOPType = GPIO_OTYPE_PUSHPULL;
	RSTPrueba.GPIO_PinConfig_t.GPIO_PinPuPdControl = GPIO_PUPDR_NOTHING;
	RSTPrueba.GPIO_PinConfig_t.GPIO_PinSpeed = GPIO_OSPEED_HIGH;

