Carjes23/STM32CortexM4ElectronicaDigital/ProyectoFinalEntrega/App/Src/main.c
}

//Calback del timer2 para el blinking
void BasicTimer2_Callback(void) {
	GPIOxTooglePin(&handlerUserLedPin);
	if (gameMode == 0) {
		flagRefrescoMenu++;
	}

}

//Calback del timer5 para el movimiento
void BasicTimer5_Callback(void) {
	contadorMovimiento++;
	if (newChangeRecently == 1) {
		contadorNewChange++;
	}
}

void USART2Rx_Callback(void) {


}

void drawInitialSnake(void) {

	// Definir las cordenadas de los rectangilos
	tailPositionX = snakePositions[0][0], tailPositionY = snakePositions[1][0], headPositionX =
			snakePositions[0][snakeSize - 1], headPositionY =
			snakePositions[1][snakeSize - 1];

	// Se rellena el rectangulo donde se encuentra la snake
	ILI9341_FillRectangle(&ili, tailPositionX, tailPositionY,
			headPositionX + squareSize, headPositionY + squareSize, snakeColor);
	ILI9341_FillRectangle(&ili, headPositionX, headPositionY,
			headPositionX + squareSize, headPositionY + squareSize, snakeColor);

}

void advanceSnake(void) {
	//Funcion que se encarga de cambiar la direccion si se tiene habilitado el enableChandeDir se cambia la direccion
	//Sino solo se avanza todas las funciones de movimiento se paracen
	//Todos las direccines son parecidas primero se verifica si se sigue normalmente, se traspasa o se choca
	//Y asi se calcula donde se dibuja el siguiente rectangulo
	if (enableChangeDir == 1) {
		if (direction == RIGHT) {
			//Se hacen consideracciones de los nniveles ya que en unos se traspasa y en otros se choca contra la parde
			if (level == 1) {
				//Estos If nos permiten determinar traspasar
				if (snakePositions[0][snakeSize - 1] + squareSize < 319) {
					headPositionX = snakePositions[0][snakeSize - 1] + 16;
				} else {
					headPositionX = 0;
				}
				headPositionY = snakePositions[1][snakeSize - 1];
			} else {
				//Estos If nos permiten
				if (snakePositions[0][snakeSize - 1] + squareSize < 319 - 16) {
					headPositionX = snakePositions[0][snakeSize - 1] + 16;
				} else {
					flagDeath = 1;
				}
			}

			checkCollision();

			if (flagFoodCollision == false) {
				tailPositionX = snakePositions[0][0], tailPositionY =
						snakePositions[1][0];
				//Limpiar el valor de la cola
				for (int i = 0; i < snakeSize - 1; i++) {
					snakePositions[0][i] = snakePositions[0][i + 1];
					snakePositions[1][i] = snakePositions[1][i + 1];
				}
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;

			}

			else {
				snakeSize++;
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			}

		}

		else if (direction == DOWN) {
			if (level == 1) {
				if (snakePositions[1][snakeSize - 1] + squareSize < 239) {
					headPositionY = snakePositions[1][snakeSize - 1] + 16;
				} else {
					headPositionY = 0;
				}
				headPositionX = snakePositions[0][snakeSize - 1];
			}

			else {
				if (snakePositions[1][snakeSize - 1] + squareSize < 239 - 16) {
					headPositionY = snakePositions[1][snakeSize - 1] + 16;
				} else {
					flagDeath = 1;
				}
				headPositionX = snakePositions[0][snakeSize - 1];
			}

			checkCollision();

			if (flagFoodCollision == false) {
				tailPositionX = snakePositions[0][0], tailPositionY =
						snakePositions[1][0];

				for (int i = 0; i < snakeSize - 1; i++) {
					snakePositions[0][i] = snakePositions[0][i + 1];
					snakePositions[1][i] = snakePositions[1][i + 1];
				}
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			} else {
				snakeSize++;
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			}

		}

		else if (direction == UP) {
			if (level == 1) {
				if (snakePositions[1][snakeSize - 1] == 0) {
					headPositionY = 240 - 16;
				} else {
					headPositionY = snakePositions[1][snakeSize - 1] - 16;
				}
			} else {
				if (snakePositions[1][snakeSize - 1] <= 16) {
					flagDeath = 1;
				} else {
					headPositionY = snakePositions[1][snakeSize - 1] - 16;
				}
			}

			headPositionX = snakePositions[0][snakeSize - 1];

			checkCollision();

			if (flagFoodCollision == false) {
				tailPositionX = snakePositions[0][0], tailPositionY =
						snakePositions[1][0];
				//Limpiar el valor de la cola
				for (int i = 0; i < snakeSize - 1; i++) {
					snakePositions[0][i] = snakePositions[0][i + 1];
					snakePositions[1][i] = snakePositions[1][i + 1];
				}

				snakePositions[0][snakeSize - 1] = headPositionX;
				snakePositions[1][snakeSize - 1] = headPositionY;

			} else {
				snakeSize++;
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			}

		}

		else if (direction == LEFT) {
			if (level == 1) {
				if (snakePositions[0][snakeSize - 1] == 0) {
					headPositionX = 320 - 16;
				} else {
					headPositionX = snakePositions[0][snakeSize - 1] - 16;
				}
			} else {
				if (snakePositions[0][snakeSize - 1] <= 16) {
					flagDeath = 1;
				} else {
					headPositionX = snakePositions[0][snakeSize - 1] - 16;
				}
			}

			headPositionY = snakePositions[1][snakeSize - 1];

			checkCollision();

			if (flagFoodCollision == false) {

				tailPositionX = snakePositions[0][0], tailPositionY =
						snakePositions[1][0];
				//Limpiar el valor de la cola
				for (int i = 0; i < snakeSize - 1; i++) {
					snakePositions[0][i] = snakePositions[0][i + 1];
					snakePositions[1][i] = snakePositions[1][i + 1];
				}
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			} else {
				snakeSize++;
				snakePositions[1][snakeSize - 1] = headPositionY;
				snakePositions[0][snakeSize - 1] = headPositionX;
			}
		}
	}

	//Se verifica si se tiene la bandera de que se choco la snaje

	if (flagDeath) {
		direction = PAUSE;
		enableChangeDir = 0;
	}

	//Si se tiene diferente a pause se dibuja la siguiente posicion se suma
	//el score si se come la comida y el score temproral que lo que nos ayduda es a cambiar la velocidad
	//cada cierto score
	if (direction != PAUSE) {
		if (flagFoodCollision == false) {
			ILI9341_FillRectangle(&ili, tailPositionX, tailPositionY,
					tailPositionX + squareSize, tailPositionY + squareSize,
					backgroundColor);
			ILI9341_FillRectangle(&ili, headPositionX, headPositionY,
					headPositionX + squareSize, headPositionY + squareSize,
					snakeColor);
		} else {
			ILI9341_FillRectangle(&ili, headPositionX, headPositionY,
					headPositionX + squareSize, headPositionY + squareSize,
					snakeColor);
			flagFoodCollision = false;
			banderaComida = false;
			score++;
			tempScore++;
		}

