Carjes23/STM32CortexM4ElectronicaDigital/ProyectoFinalEntrega/App/Src/main.c
	}

	else {
		__NOP();
	}
}

//Variables encargadas de cambiar la dirrecion
void changeDirection(void) {
	if (enableChange == 1) {
		if (newDirVal == UP) {
			if (direction != DOWN) {
				direction = UP;
				star = 1;
				newDirVal = 0;
			}
		} else if (newDirVal == LEFT && star == 1) {
			if (direction != RIGHT) {
				direction = LEFT;
				newDirVal = 0;
			}
		} else if (newDirVal == DOWN) {
			if (direction != UP) {
				direction = DOWN;
				star = 1;
				newDirVal = 0;
			}

		} else if (newDirVal == RIGHT) {
			if (direction != LEFT) {
				direction = RIGHT;
				star = 1;
				newDirVal = 0;
			}

		}
		newDirVal = 0;
		enableChange = 0;
		newChangeRecently = 1;
	} else {
		newDirVal = 0;
	}

}

void createFood(void) {
	//Se crea la comida si no se encuentra

	ILI9341_FillRectangle(&ili, foodPositionX, foodPositionY,
			foodPositionX + squareSize, foodPositionY + squareSize, foodColor);

	banderaComida = true;
}
//Se verifica si hay colision con la comida
bool checkCollisionFood(uint16_t x, uint16_t y) {
	for (int i = 0; i < snakeSize; i++) {
		if (x == snakePositions[0][i] && y == snakePositions[1][i]) {
			return true;

		}
	}
	if (x == headPositionX && y == headPositionY) {
		return true;

	}
	if (level != 1) {
		if (x <= 15 || y <= 15 || x >= 319 - 16 || y >= 239 - 16) {
			return true;
		}
	}
	return false;
}
//Se verifica la colicion de muerte
void checkCollision(void) {
	for (int i = 0; i < snakeSize; i++) {
		if (foodPositionX == snakePositions[0][i]
				&& foodPositionY == snakePositions[1][i]) {
			flagFoodCollision = true;
		}
		if (headPositionX == snakePositions[0][i]
				&& headPositionY == snakePositions[1][i]) {
			flagDeath = true;
		}
	}
	if (foodPositionX == headPositionX && foodPositionY == headPositionY) {
		flagFoodCollision = true;
	}
}
//Se genera el random para la comida
void randomFood(void) {
	uint8_t tempx = rand() % 20, tempy = rand() % 15;
	if (checkCollisionFood(tempx * 16, tempy * 16) == false) {
		foodPositionX = tempx * 16;
		foodPositionY = tempy * 16;
	} else {
		randomFood();
	}
}
//Se incrementa la velocidad
void increseSpeed(void) {
	float aux = (periodADC * 0.95f);
	periodADC = (int) (aux);
	if (periodADC >= 20) {
		updateFrequency(&pwmadc, periodADC);
	}
}
//Se resetea el modo facil
void resetEasyMode(void) {
	score = 0;
	star  = 0;
	periodADC = 25000;
	banderaComida = false;
	updateFrequency(&pwmadc, periodADC);
	snakeSize = 3;
	snakePositions[0][0] = 16 * 6;
	snakePositions[0][1] = 16 * 7;
	snakePositions[0][2] = 16 * 8;
	snakePositions[1][0] = 16 * 7;
	snakePositions[1][1] = 16 * 7;
	snakePositions[1][2] = 16 * 7;
	direction = PAUSE;
	newDirVal = PAUSE;
	adcIsCompleteCount = 0;

	ILI9341_FillRectangle(&ili, 0, 0, ILI9341_TFTHEIGHT - 1,
	ILI9341_TFTWIDTH - 1, backgroundColor);

	drawInitialSnake();
	enableChangeDir = 1;
}
//Se resetea el modo normal
void resetNormalMode(void) {
	score = 0;
	star =0;
	periodADC = 25000;
	banderaComida = false;
	updateFrequency(&pwmadc, periodADC);
	snakeSize = 3;
	snakePositions[0][0] = 16 * 6;
	snakePositions[0][1] = 16 * 7;
	snakePositions[0][2] = 16 * 8;
	snakePositions[1][0] = 16 * 7;
	snakePositions[1][1] = 16 * 7;
	snakePositions[1][2] = 16 * 7;
	direction = PAUSE;
	newDirVal = PAUSE;
	adcIsCompleteCount = 0;

	// Fill the entire screen with the background color
	ILI9341_FillRectangle(&ili, 0, 0, ILI9341_TFTHEIGHT - 1,
	ILI9341_TFTWIDTH - 1, wallColor);
	ILI9341_FillRectangle(&ili, 16, 16, ILI9341_TFTHEIGHT - 1 - 16,
	ILI9341_TFTWIDTH - 1 - 16, backgroundColor);

	drawInitialSnake();
	enableChangeDir = 1;
}
//Se resetea el modo dificil
void resetHardMode(void) {
	score = 0;
	star = 0;
	periodADC = 10000;
	banderaComida = false;
	updateFrequency(&pwmadc, periodADC);
	snakeSize = 3;
	snakePositions[0][0] = 16 * 6;
	snakePositions[0][1] = 16 * 7;
	snakePositions[0][2] = 16 * 8;
	snakePositions[1][0] = 16 * 7;
	snakePositions[1][1] = 16 * 7;
	snakePositions[1][2] = 16 * 7;
	direction = PAUSE;
	newDirVal = PAUSE;
	adcIsCompleteCount = 0;


	// Fill the entire screen with the background color
	ILI9341_FillRectangle(&ili, 0, 0, ILI9341_TFTHEIGHT - 1,
	ILI9341_TFTWIDTH - 1, wallColor);
	ILI9341_FillRectangle(&ili, 16, 16, ILI9341_TFTHEIGHT - 1 - 16,
	ILI9341_TFTWIDTH - 1 - 16, backgroundColor);

	drawInitialSnake();
	enableChangeDir = 1;
}
//Se dibuja el meni
void updateMenu(void) {
	if (selected == 1) {
		ILI9341_WriteString(&ili, menux, menuy * 3, menucolor, backgroundColor,
				menu2, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 5, menucolor, backgroundColor,
				menu3, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy, menucolorSelect,
				backgroundColor, menu1, 4, 4);
	} else if (selected == 2) {
		ILI9341_WriteString(&ili, menux, menuy, menucolor, backgroundColor,
				menu1, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 5, menucolor, backgroundColor,
				menu3, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 3, menucolorSelect,
				backgroundColor, menu2, 4, 4);
	} else if (selected == 3) {
		ILI9341_WriteString(&ili, menux, menuy, menucolor, backgroundColor,
				menu1, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 3, menucolor, backgroundColor,
				menu2, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 5, menucolorSelect,
				backgroundColor, menu3, 4, 4);
	} else {
		ILI9341_WriteString(&ili, menux, menuy * 5, menucolor, backgroundColor,
				menu3, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy * 3, menucolor, backgroundColor,
				menu2, 4, 4);
		ILI9341_WriteString(&ili, menux, menuy, menucolorSelect,
				backgroundColor, menu1, 4, 4);
	}
}

//Movimiento izquierda
void callback_extInt0(void) {
	newDirVal = LEFT;

}
//Movimiento derecha
void callback_extInt1(void) {
	newDirVal = RIGHT;
}
//Movimiento arriba
void callback_extInt2(void) {
	newDirVal = DOWN;
}
//Movimiento abajo
void callback_extInt3(void) {
	newDirVal = UP;
}

//Movimiento abajo
void callback_extInt13(void) {
	gameMode = 0;
	level = 0;
	ILI9341_FillRectangle(&ili, 0, 0, ILI9341_TFTHEIGHT - 1,
						ILI9341_TFTWIDTH - 1, backgroundColor);
}

